#########################Packages#################
*************************EDA**********************
1) Pandas - Dataframe analysis
2) numpy  - numerical python/ number python
3) Mathplotlib - plot
4) seaborn - plot
5) plotly - plot
6) bokhe - plot
************************ML************************
7) scikit-learn - sklearn
************************DL************************
8) tensorflow
9) keras
10) pytorch
11) open cv (CV) : Computer Vision
************************NLP************************
12)NLTK
13)Scipy
**********************GenerativeAI*****************
14) Chatgpt : openAI
15) Makersuit : google generative ai
16) Amazon Q
***************************Hugging face transformation(BERT)*******************************
17)Transformers
***************************Others*********************************************
random
math
os
sys
time

In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [11]:
file_path = "C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\visadataset.csv"
pd.read_csv(file_path)

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV00001,Europe,High School,N,Y,12815,1986,South,100248.93,Year,N,Certified
1,EZYV00002,North Am,Bachelor's,N,Y,58485,1955,Northeast,36080.79,Year,Y,Certified
2,EZYV00003,Asia,High School,Y,Y,31262,1904,Midwest,117927.92,Year,N,Certified
3,EZYV00004,North Am,Bachelor's,N,Y,42617,1993,Midwest,110256.05,Hour,N,Certified
4,EZYV00005,Africa,Doctorate,N,Y,69628,1909,Northeast,135456.27,Hour,Y,Denied
...,...,...,...,...,...,...,...,...,...,...,...,...
195,EZYV00196,Africa,Bachelor's,Y,N,14629,2004,West,91543.97,Hour,Y,Denied
196,EZYV00197,Europe,Master's,Y,Y,7504,2012,West,80136.89,Hour,Y,Denied
197,EZYV00198,Africa,High School,Y,Y,43149,1900,South,100729.22,Year,N,Certified
198,EZYV00199,North Am,Master's,N,Y,111098,1888,South,74387.16,Year,Y,Denied
199,EZYV00200,Africa,Bachelor's,Y,N,140121,1981,Midwest,46578.32,Year,Y,Denied

In [13]:
list1 = ['Ram','Raheem','Robert']
list2 = [30,31,32]
pd.DataFrame(zip(list1,list2))

        0   1
0     Ram  30
1  Raheem  31
2  Robert  32

In [29]:
# To give column name
list1 = ['Ram','Raheem','Robert']
list2 = [30,31,32]
names = pd.DataFrame(zip(list1,list2),columns = ['Name','Age'])
names

     Name  Age
0     Ram   30
1  Raheem   31
2  Robert   32

In [31]:
# What is your dataframe name : names
# Where you want to save : C:\Users\Kishan D K\OneDrive\Documents\Data_science\Data_files
# What name you want to provide : NAMES_data
names.to_csv("C:\\Users\\Kishan D K\\OneDrive\\Documents\\Data_science\\Data_files\\NAMES_data.csv")

In [37]:
# if we dont provide the location, then it will save in the location where your python file located
names.to_csv("NAMES_data.csv")

In [39]:
# it will not create extra column as index
# By giving index = False [it will remove the first empty column]
names.to_csv("NAMES_1_data.csv",index = False)

$task1$

# Read the NAMES_data and NAMES_1_data

In [ ]:
#By analysing the difference btw NAMES_data and NAMES_1_data , you will know whats the use of [index = False]

In [53]:
file_path = "Names_data.csv"
pd.read_csv(file_path)

   Unnamed: 0    Name  Age
0           0     Ram   30
1           1  Raheem   31
2           2  Robert   32

In [55]:
# to avoid the Unnamed:0
file_path = "Names_1_data.csv"
pd.read_csv(file_path)

     Name  Age
0     Ram   30
1  Raheem   31
2  Robert   32

$Step - 5$

#########ADD a new column to existing dataframe#############

In [62]:
# What is your dataframe name : names
# What is the name of the new column : City
# How many rows we have in Original column : 3
# What is your new data : ['Hydrabad','Chennai','Bangalore']

names['city'] = ['Hydrabad','Chennai','Bangalore']
names

     Name  Age       city
0     Ram   30   Hydrabad
1  Raheem   31    Chennai
2  Robert   32  Bangalore

$Step - 6$
# How to drop the column #

In [ ]:
# what is your data frame name : name
******************************************
# I want to drop column
# axis=1 =========== columns
# axis=0 =========== rows
******************************************
# what is the name of the column: city
******************************************
# inplace
# when you are drop the column means
#     you are modifying the table
#     the dataframe overwrite or
#     you want to create a dataframe

# inplace=True : data will be overwrite

In [75]:
names

     Name  Age
0     Ram   30
1  Raheem   31
2  Robert   32

In [77]:
names['city'] = ['Hydrabad','Bangalore','Chennai',]
names

     Name  Age       city
0     Ram   30   Hydrabad
1  Raheem   31  Bangalore
2  Robert   32    Chennai

In [79]:
names.drop('city',axis=1, inplace = True)    # here inplace is to overwrite this in a same location(names) olny
names

     Name  Age
0     Ram   30
1  Raheem   31
2  Robert   32

In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

********Creating DataFrame using Dictionary********

In [4]:
dict1 = {'Names' : ['Ram','Raheem','Robert'],
        'Age' : [30,31,32]}
dict1

{'Names': ['Ram', 'Raheem', 'Robert'], 'Age': [30, 31, 32]}

In [10]:
pd.DataFrame(dict1)

    Names  Age
0     Ram   30
1  Raheem   31
2  Robert   32

In [14]:
pd.DataFrame(dict1,index=['a','b','c'])

    Names  Age
a     Ram   30
b  Raheem   31
c  Robert   32

In [16]:
pd.DataFrame(dict1,columns=['String','int'])

Empty DataFrame
Columns: [String, int]
Index: []